{
  "backend/main.mo": "Motoko canister managing authenticated CRUD and filtering of document metadata with blob references using Map storage.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files and components with high‑confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent changes of all key frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS theme variables for light/dark modes using OKLCH colors and base styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes wrapped in AuthGate and AppShell with theme provider and toaster.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate using Internet Identity that shows a login card with the new uncropped login image when unauthenticated.",
  "frontend/src/components/documents/DocumentActions.tsx": "Document actions UI enabling view, download, and delete operations with dialogs, toast feedback, and navigation.",
  "frontend/src/components/documents/DocumentFilters.tsx": "Renders a filter panel for documents with category, office, direction, date range, and text search, including logic to reset filters and sync office options by category.",
  "frontend/src/components/documents/DocumentList.tsx": "Displays documents in a sortable table with icons and navigation, supporting infinite loading and metadata display.",
  "frontend/src/components/documents/EmptyState.tsx": "Shows an empty-state message with an illustration and a button to navigate to the upload page.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, theme toggle, and account dropdown using Internet Identity.",
  "frontend/src/features/documents/useDeleteDocument.ts": "React Query mutation hook to delete a document and invalidate related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document by ID using React Query and the authenticated actor.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches filtered documents from backend, applies client-side text search and pagination, and returns visible results.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles uploading a document by reading the file, encoding it, sending metadata to backend, tracking progress, and refreshing queries.",
  "frontend/src/hooks/useActor.ts": "Manages creation of an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and status handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, themes, and utility classes for light and dark modes.",
  "frontend/src/lib/categoryHelpers.ts": "Maps Category enums to human-readable labels and provides category options for selects.",
  "frontend/src/lib/officeHelpers.ts": "Converts office enums and string IDs to labels or Office objects and includes helpers for office selection.",
  "frontend/src/lib/utils.ts": "Utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed information and preview of a selected document with actions and metadata.",
  "frontend/src/pages/DocumentListPage.tsx": "Shows filterable, paginated document listings with loading and error states.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Provides a form to upload a new document with file input, metadata fields, validation, and progress handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking feature requests, known issues, and requirements for updating the login screen image."
}