{
  "backend/main.mo": "Motoko canister implementing user management, access control, document storage metadata, and category/office structures with admin-restricted operations.",
  "feature_evidence.json": "Feature evidence report listing UI feature changes, affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, hooks, components, styles, and utilities.",
  "frontend/index.css": "Global Tailwind styles defining OKLCH theme tokens, dark mode variants, and base styling for background, text, borders, and components.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with authentication and role-based route guards, wrapping pages in AppShell and ThemeProvider.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that prompts Internet Identity login and shows a loading screen during initialization.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-checking component that restricts access to user or admin routes and displays unauthorized messages when needed.",
  "frontend/src/components/auth/UnauthorizedScreen.tsx": "Unauthorized access screen showing a warning icon, message, and optional button to return to the dashboard.",
  "frontend/src/components/documents/DocumentActions.tsx": "Provides action buttons for viewing, downloading, and deleting a document with confirmation dialogs and navigation.",
  "frontend/src/components/documents/DocumentFilters.tsx": "Implements document filter controls for category, office, direction, date range, and search text.",
  "frontend/src/components/documents/DocumentList.tsx": "Renders a selectable table of documents with category, office, direction, and navigation to document details.",
  "frontend/src/components/documents/EmptyState.tsx": "Displays a placeholder UI encouraging users to upload their first document.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with header navigation, theme toggle, and user menu.",
  "frontend/src/features/auth/useCallerRole.ts": "Fetches and exposes the caller's role, including admin and user checks.",
  "frontend/src/features/categories/useCategories.ts": "Loads category data from the backend using react-query.",
  "frontend/src/features/categories/useCategoryMutations.ts": "Provides mutations for adding, updating, and removing categories and offices with query invalidation and toasts.",
  "frontend/src/features/dashboard/useDashboardMetrics.ts": "Fetches dashboard metric data from the backend.",
  "frontend/src/features/documents/useDeleteDocument.ts": "Handles document deletion and invalidates related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document’s details by ID using react-query.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches and client‑filters documents with pagination using React Query and actor API.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles document upload by reading file bytes, encoding to base64, sending metadata, and invalidating queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, manages login flow, identity loading, and AuthClient setup.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode tokens, and utility classes.",
  "frontend/src/lib/categoryHelpers.ts": "Provides helpers to format category labels and map categories into select options.",
  "frontend/src/lib/exportDocuments.ts": "Converts document metadata into CSV and triggers a file download.",
  "frontend/src/lib/officeHelpers.ts": "Returns office options and resolves office names from category data.",
  "frontend/src/lib/utils.ts": "Utility to merge class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics and category navigation with loading and error states.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed document info with preview, metadata, and actions, handling loading and errors.",
  "frontend/src/pages/DocumentListPage.tsx": "Provides a filterable, paginated document list with selection and CSV export functionality.",
  "frontend/src/pages/SettingsPage.tsx": "Manages categories and offices with dialogs for adding, editing, and deleting entries.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Handles uploading documents with validation, metadata fields, progress, and success feedback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters for routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing UI updates, button styling changes, and a dashboard bug where 'Documents by direction' incorrectly reports 0. Includes existing features, pending feature requests, and architectural notes for sourcing counts from backend data."
}