{
  "backend/main.mo": "Motoko actor managing documents with add, remove, get, and filter operations, storing metadata and blob references with authentication checks.",
  "feature_evidence.json": "Feature evidence mapping showing which frontend files implement specific feature requests and related components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing their roles in routing, UI, document features, and utilities.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and dark mode tokens applied to base styling.",
  "frontend/index.html": "HTML entry point containing root mount node and script loading the React application.",
  "frontend/src/App.tsx": "Main app router setup with authenticated layout and routes for list, upload, and detail pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that prompts for Internet Identity login before showing protected content.",
  "frontend/src/components/documents/DocumentActions.tsx": "Per-document action menu enabling viewing, downloading, and deleting documents with confirmation dialog.",
  "frontend/src/components/documents/DocumentFilters.tsx": "UI component providing search, category, office, direction, and date filters for documents, with logic to reset and validate selections.",
  "frontend/src/components/documents/DocumentList.tsx": "Renders a paginated table of documents with metadata, icons, and navigation to detail pages.",
  "frontend/src/components/documents/EmptyState.tsx": "Displays an empty state illustration and button to upload a document when no documents exist.",
  "frontend/src/components/layout/AppShell.tsx": "App layout with navigation, theme toggle, identity menu, and header branding.",
  "frontend/src/features/documents/useDeleteDocument.ts": "React Query mutation hook to delete a document and invalidate related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document by ID using the actor and React Query.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches and client‑filters a list of documents with pagination and query parameters.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles uploading a document, converting file data to base64, sending metadata, and tracking progress.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context, provider, and hook for managing Internet Identity authentication using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base layers with light/dark theme CSS variables and global styling.",
  "frontend/src/lib/categoryHelpers.ts": "Maps Category enums to display labels and provides selectable category option lists.",
  "frontend/src/lib/officeHelpers.ts": "Converts office enums and strings to readable labels and Office objects.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for class merging.",
  "frontend/src/main.tsx": "Sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the App.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed document info with preview, metadata, and actions.",
  "frontend/src/pages/DocumentListPage.tsx": "Shows searchable, filterable document list with pagination support.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Form page for uploading documents with validation, progress, and success handling.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Tracks project state including UI update requirements, existing features, and pending feature requests for header styling, category-based filtering, and a new table column."
}