{
  "backend/main.mo": "Motoko canister implementing user management, access control, document storage, and category/office structures with admin‑restricted mutations.",
  "feature_evidence.json": "Feature evidence report linking new mobile navigation, role‑based visibility, and mobile layout requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing routing, layout, document features, styling, and utility modules.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions providing light/dark theme tokens and base styling across the app.",
  "frontend/index.html": "HTML entrypoint that loads the React app via main.tsx and defines the root mount element.",
  "frontend/src/App.tsx": "Sets up TanStack Router with role‑guarded routes wrapped in AppShell and AuthGate, including admin‑only settings.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate showing an Internet Identity login screen until the user is authenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑enforcement wrapper that blocks access with an unauthorized screen if caller role does not meet user/admin requirements.",
  "frontend/src/components/auth/UnauthorizedScreen.tsx": "Unauthorized access screen with an alert icon and optional button returning the user to the dashboard.",
  "frontend/src/components/documents/DocumentActions.tsx": "Provides actions for viewing, downloading, and deleting a document, including confirmation dialogs and UI menus.",
  "frontend/src/components/documents/DocumentFilters.tsx": "Renders document filter controls for search, category, office, direction, and date range with automatic state handling.",
  "frontend/src/components/documents/DocumentList.tsx": "Displays a table of documents with selection, navigation, and category/office/direction metadata.",
  "frontend/src/components/documents/EmptyState.tsx": "Shows a placeholder view encouraging users to upload a document when none are present.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with header navigation, theme toggle, and user menu.",
  "frontend/src/components/layout/MobileNavMenu.tsx": "Implements a mobile dropdown navigation menu with links and admin‑only options.",
  "frontend/src/features/auth/useCallerRole.ts": "Fetches and exposes the caller’s user role using React Query and actor APIs.",
  "frontend/src/features/categories/useCategories.ts": "Loads the list of categories from the backend via the actor using React Query.",
  "frontend/src/features/categories/useCategoryMutations.ts": "Provides mutations for adding, updating, and removing categories and offices with cache invalidation and toasts.",
  "frontend/src/features/dashboard/useDashboardMetrics.ts": "Fetches dashboard metrics from the backend using the actor and React Query.",
  "frontend/src/features/documents/useDeleteDocument.ts": "Provides a mutation hook to delete a document and invalidate related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document by ID using the actor and react-query.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches and filters document lists with pagination and search support.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles document upload, converting files to base64 and adding metadata to backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity management context.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and custom utilities.",
  "frontend/src/lib/categoryHelpers.ts": "Utility functions for formatting and listing category options.",
  "frontend/src/lib/exportDocuments.ts": "Converts documents to CSV format and triggers a file download.",
  "frontend/src/lib/officeHelpers.ts": "Provides helper functions for office option lists and name lookup.",
  "frontend/src/lib/utils.ts": "Utility for merging Tailwind class names with clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard UI showing categories, metrics, and navigation.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed information for a single document, including metadata, preview, and actions with loading and error states.",
  "frontend/src/pages/DocumentListPage.tsx": "Shows a filterable, searchable, and selectable list of documents with CSV export support and infinite loading.",
  "frontend/src/pages/SettingsPage.tsx": "Provides interfaces to add, edit, and remove categories and offices using dialogs and mutation hooks.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Handles uploading new documents with metadata fields, validation, progress tracking, and success state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Describes the current state of the Document Archive project, including mobile navigation issues and pending custom domain and hamburger-menu feature requests. Lists existing features, known issues, and architectural metadata."
}