{
  "backend/main.mo": "Motoko canister defining document types, storage, authentication checks, and CRUD plus filtering logic for documents.",
  "feature_evidence.json": "Feature evidence report mapping high‑level feature requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and pages.",
  "frontend/index.css": "Global Tailwind-based CSS defining theme tokens for light/dark modes and applying base styles.",
  "frontend/index.html": "HTML bootstrap file providing the root container and loading the frontend entry script.",
  "frontend/src/App.tsx": "Main application router configuring routes for dashboard, documents, upload, and detail pages within AuthGate and AppShell.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper using Internet Identity, showing a login card until the user is authenticated.",
  "frontend/src/components/documents/DocumentActions.tsx": "Action menu for individual documents supporting viewing, downloading, and deleting with confirmation and navigation.",
  "frontend/src/components/documents/DocumentFilters.tsx": "UI component for searching and filtering documents by category, office, direction, dates, and text with reset logic and dependent office options.",
  "frontend/src/components/documents/DocumentList.tsx": "Displays a table of documents with selection, navigation, and load-more functionality including icons and metadata.",
  "frontend/src/components/documents/EmptyState.tsx": "Shows a placeholder screen with an image and button prompting users to upload a document when none exist.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, theme toggle, and user menu, wrapping application content.",
  "frontend/src/features/categories/useCategories.ts": "React Query hook that fetches category data from the backend actor.",
  "frontend/src/features/documents/useDeleteDocument.ts": "Mutation hook to delete a document and invalidate related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document by ID using React Query and the backend actor.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches filtered documents from backend, applies client-side text search and pagination.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles document upload including file reading, base64 conversion, metadata creation, and backend submission.",
  "frontend/src/hooks/useActor.ts": "Manages creation and lifecycle of authenticated or anonymous backend actors, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login state and loading identities from storage.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with utility helpers.",
  "frontend/src/lib/categoryHelpers.ts": "Maps backend Category values to human-readable labels and provides category select options.",
  "frontend/src/lib/exportDocuments.ts": "Converts document data into CSV format and triggers a downloadable export.",
  "frontend/src/lib/officeHelpers.ts": "Maps Office union types to display labels and converts string identifiers to Office objects.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a grid of categories and navigates to document listings on selection.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Shows detailed information and preview for a selected document with related actions.",
  "frontend/src/pages/DocumentListPage.tsx": "Page component that loads, filters, selects, and exports documents with UI for filters, list display, and CSV export.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Page for uploading a document with file input, metadata fields, validation, and upload progress handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing requirements, features, architecture notes, and pending feature requests for a document app."
}