{
  "backend/main.mo": "Main actor implementing access control, user profiles, categories, and document storage with authorization checks and migration mixins.",
  "backend/migration.mo": "Migration module defining legacy types and returning the previous actor state unchanged.",
  "feature_evidence.json": "Feature evidence report listing features, affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference in build planning.",
  "frontend/index.css": "Global Tailwind CSS styles defining theme tokens and dark mode variables.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React router setup with AuthGate and role‑protected routes for dashboard, documents, upload, details, and settings.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate that initializes Internet Identity and displays a login screen until authenticated.",
  "frontend/src/components/auth/PermissionsErrorScreen.tsx": "UI screen shown when permission checks fail or time out, with retry and navigation options.",
  "frontend/src/components/auth/RequireRole.tsx": "Route guard that fetches caller roles, handles timeouts and errors, and enforces admin or user permissions.",
  "frontend/src/components/auth/UnauthorizedScreen.tsx": "Displays an unauthorized access message with an optional button to return to the dashboard.",
  "frontend/src/components/documents/DocumentActions.tsx": "Provides actions for a document including view, download, and delete with confirmation dialogs.",
  "frontend/src/components/documents/DocumentFilters.tsx": "Renders filtering controls for documents such as search, category, office, direction, and date range.",
  "frontend/src/components/documents/DocumentList.tsx": "Displays a selectable table of documents with metadata and navigation to document details.",
  "frontend/src/components/documents/EmptyState.tsx": "Shows an empty state illustration with a prompt to upload the first document.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with navigation, theme toggle, user menu, and header branding.",
  "frontend/src/components/layout/MobileNavMenu.tsx": "Implements a mobile-friendly dropdown navigation menu with admin-only options.",
  "frontend/src/features/auth/useCallerRole.ts": "Fetches and exposes the current user's role with loading, retry, and error handling.",
  "frontend/src/features/categories/useCategories.ts": "Fetches the list of categories from the backend once an actor is available.",
  "frontend/src/features/categories/useCategoryMutations.ts": "Provides React Query mutations for adding, updating, and removing categories and offices, invalidating category queries and showing toast messages.",
  "frontend/src/features/dashboard/useDashboardMetrics.ts": "Fetches and computes dashboard metrics by filtering documents client‑side until backend metrics are available.",
  "frontend/src/features/documents/useDeleteDocument.ts": "Defines a mutation to delete a document and invalidates related queries after removal.",
  "frontend/src/features/documents/useDocument.ts": "Loads a single document by ID using React Query and the backend actor.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches filtered documents, applies text search and sorting client‑side, and supports incremental loading.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles uploading a document by encoding the file, sending metadata to the backend, tracking progress, and invalidating queries on success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence via a React context.",
  "frontend/src/index.css": "Sets up Tailwind styles, CSS variables for themes, and utility classes including line clamping and popover background rules.",
  "frontend/src/lib/categoryHelpers.ts": "Provides helpers for rendering category labels and converting categories into select options.",
  "frontend/src/lib/exportDocuments.ts": "Converts document data into CSV format and triggers a file download.",
  "frontend/src/lib/officeHelpers.ts": "Provides helpers to list office options and resolve office names from a category.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics and category navigation, handling loading and error states. Shows totals, direction counts, and category cards linking to documents.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Shows detailed information and preview for a single document, with actions, metadata, and navigation. Handles loading, errors, and direction/category formatting.",
  "frontend/src/pages/DocumentListPage.tsx": "Lists documents with filters, infinite loading, selection, and CSV export. Manages filter state, syncing with route params, and selection logic.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for managing categories and offices, including add, edit, and delete dialogs. Uses mutations and form state to update configuration.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Handles uploading a new document with form inputs, validation, progress, and success state. Supports category/office selection and direction input.",
  "frontend/src/utils/urlParams.ts": "Utility module for getting URL parameters, persisting them in sessionStorage, and clearing them from URL hashes for routing and token handling.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project state file describing current architecture notes, issues, and feature requests related to fixing login permission checks and role resolution."
}