{
  "backend/main.mo": "Motoko actor managing authenticated document storage with add, remove, get, and filter operations using blob references.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file providing high-level summaries of various frontend source files.",
  "frontend/index.css": "Global Tailwind-based theme variables and dark mode styles using OKLCH color tokens.",
  "frontend/index.html": "Base HTML entry file mounting the root React app.",
  "frontend/src/App.tsx": "Main React router setup wrapping routes in authentication and app shell providers.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate showing a login card with logo until Internet Identity is available.",
  "frontend/src/components/documents/DocumentActions.tsx": "Document action menu providing view, download, and delete operations with confirmation dialog.",
  "frontend/src/components/documents/DocumentFilters.tsx": "UI component providing category, office, direction, date range, and text filters for documents, with logic to reset and validate selections.",
  "frontend/src/components/documents/DocumentList.tsx": "Displays a table of documents with metadata, direction icons, and navigation to detail pages, including load-more support.",
  "frontend/src/components/documents/EmptyState.tsx": "Shows an empty state illustration and button to upload a document when no documents exist.",
  "frontend/src/components/layout/AppShell.tsx": "Application layout with header, navigation, theme toggle, and user account menu wrapping page content.",
  "frontend/src/features/documents/useDeleteDocument.ts": "React Query mutation hook for deleting a document and invalidating related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document by ID using React Query and the backend actor.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches filtered documents from backend, applies client-side search and sorting, and manages incremental pagination.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles uploading a document, converting file data to base64, creating metadata, and invalidating queries post-upload.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login, and logout. Includes helpers to create an AuthClient and expose status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, plus utility classes like line clamping.",
  "frontend/src/lib/categoryHelpers.ts": "Maps Category enum values to display labels and provides a list of category option objects.",
  "frontend/src/lib/officeHelpers.ts": "Converts Office enum variants to human‑readable labels and maps string IDs to Office objects. Also includes helpers for nursing and generic offices.",
  "frontend/src/lib/utils.ts": "Exports a cn function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed information for a single document, including preview, metadata, and actions. Handles loading and error states.",
  "frontend/src/pages/DocumentListPage.tsx": "Shows a filterable, paginated list of documents with loading and error handling. Integrates DocumentFilters and DocumentList components.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Form page for uploading documents with validation, progress tracking, and success state handling. Supports selecting category, office, direction, and metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements to replace login/sign-in images with a user-uploaded photo, including existing features, issues, and metadata."
}