{
  "backend/main.mo": "Main Motoko canister implementing access control, storage mixins, user accounts, documents, categories, and admin-only user management APIs.",
  "backend/migration.mo": "No-op migration module that returns state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind and OKLCH theme tokens defining light/dark mode colors and solid popover backgrounds.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main router setup enforcing role-based access for dashboard, documents, upload, detail, and admin settings pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate using Internet Identity to block access until the user signs in.",
  "frontend/src/components/auth/RequireRole.tsx": "Role enforcement wrapper that checks admin/user permissions and returns an unauthorized screen if insufficient.",
  "frontend/src/components/auth/UnauthorizedScreen.tsx": "Unauthorized access screen showing an alert icon, message, and optional navigation back to the dashboard.",
  "frontend/src/components/documents/DocumentActions.tsx": "Provides UI actions to view, download, and delete a document, including confirmation dialogs and menu options.",
  "frontend/src/components/documents/DocumentFilters.tsx": "Implements filter controls for searching and filtering documents by category, office, direction, and date range.",
  "frontend/src/components/documents/DocumentList.tsx": "Renders a selectable table of documents with category, office, direction, and date details, enabling navigation to document pages.",
  "frontend/src/components/documents/EmptyState.tsx": "Displays an empty-state illustration with a prompt and button to upload the first document.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout shell with navigation, theme toggle, user menu, and role‑based options.",
  "frontend/src/features/auth/useCallerRole.ts": "Fetches and exposes the caller’s role with admin/user helpers using React Query.",
  "frontend/src/features/categories/useCategories.ts": "Loads the list of categories from the backend using React Query.",
  "frontend/src/features/categories/useCategoryMutations.ts": "Provides mutations for adding, updating, and removing categories and offices with query invalidation and toasts.",
  "frontend/src/features/dashboard/useDashboardMetrics.ts": "Fetches dashboard metrics from the backend when the actor is available.",
  "frontend/src/features/documents/useDeleteDocument.ts": "Defines a mutation to delete a document and invalidate related queries.",
  "frontend/src/features/documents/useDocument.ts": "Fetches a single document’s details by ID using React Query.",
  "frontend/src/features/documents/useDocuments.ts": "Fetches and filters documents with pagination, text search, and sorting using React Query and the actor API.",
  "frontend/src/features/documents/useUploadDocument.ts": "Handles document uploads including file conversion, metadata creation, backend submission, and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout via a React context and AuthClient.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode values, and utility layers.",
  "frontend/src/lib/categoryHelpers.ts": "Provides helpers for converting category data into display labels and select options.",
  "frontend/src/lib/exportDocuments.ts": "Converts documents into CSV format and triggers a file download.",
  "frontend/src/lib/officeHelpers.ts": "Generates office select options and resolves office names based on category data.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with category data and document/user metrics, handling loading and navigation.",
  "frontend/src/pages/DocumentDetailPage.tsx": "Displays detailed document information with preview, metadata, and actions, handling loading and errors.",
  "frontend/src/pages/DocumentListPage.tsx": "Shows a filterable, searchable document list with selection, CSV export, and infinite loading.",
  "frontend/src/pages/SettingsPage.tsx": "Provides interfaces to add, edit, and delete categories and offices with dialogs and mutation hooks.",
  "frontend/src/pages/UploadDocumentPage.tsx": "Handles document upload with form fields, validation, progress tracking, and success state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings.",
  "project_state.json": "Defines the project's current state, including architecture notes, known issues, existing features, and new feature requests. Tracks role-based access plans, UI fixes, and backend user management requirements."
}