{
  "kind": "build_request",
  "title": "Fix post-login permissions check getting stuck and navigate to dashboard",
  "projectName": "Document Archive",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the authenticated route gate so the app does not remain indefinitely on the \"Checking permissions...\" loading UI after a successful Internet Identity login, and instead proceeds to render the requested page (default: dashboard at \"/\") once the caller role has been resolved or a terminal error state has been reached.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "app stuck on checking permissions",
          "1 navigate to dashboard 2 modify existing 3 internet identity i guess not sure"
        ]
      },
      "acceptanceCriteria": [
        "After completing an Internet Identity login redirect, the app does not remain on the \"Checking permissions...\" screen indefinitely.",
        "When role resolution completes successfully, the dashboard at path \"/\" renders normally for authorized users.",
        "If role resolution fails (e.g., backend call error), the UI shows a clear error state with an actionable way to retry and/or navigate to the dashboard, rather than showing an infinite spinner."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the caller-role fetching flow used by the permissions gate to be resilient to actor initialization edge cases (e.g., actor not ready yet, initialization errors) so that it reaches a success or error state reliably after login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "app stuck on checking permissions"
        ]
      },
      "acceptanceCriteria": [
        "Role fetching transitions out of the loading state reliably after login (either to success or a visible error state).",
        "A user can trigger a retry of the role check from the UI without a full page refresh (if the first attempt fails)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure backend authorization initialization and role lookup do not block normal authenticated usage when no admin secret token is provided, so frontend role checks can complete promptly after Internet Identity login.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "app stuck on checking permissions",
          "internet identity i guess not sure"
        ]
      },
      "acceptanceCriteria": [
        "Calls involved in initializing access control for non-admin users complete promptly even when the secret/token parameter is empty or missing.",
        "The backend method used by the frontend to determine the caller's role returns a result or an explicit error promptly (no hanging behavior) after login."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (they are immutable).",
    "Keep all Motoko logic within the single backend actor in backend/main.mo; only add backend/migration.mo if an upgrade requires state migration."
  ],
  "nonGoals": [
    "Adding a new authentication provider (only Internet Identity is in scope).",
    "Implementing real-time features (WebSockets/push).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}