{
  "kind": "build_request",
  "title": "Add mobile hamburger menu for primary navigation",
  "projectName": "Document Archive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a mobile navigation control (hamburger menu) in the AppShell header that is shown on small screens (below the current md breakpoint) and contains navigation items for Dashboard, Documents, Upload, and Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1 hamburger menu. 2 yes dashboard,documents,upload,setting. 3 just adapt for small screens."
        ]
      },
      "acceptanceCriteria": [
        "On viewport widths below the md breakpoint, the current desktop header nav buttons are not shown and a hamburger button is shown instead.",
        "Tapping/clicking the hamburger button opens a menu listing: Dashboard, Documents, Upload, and Settings.",
        "Selecting a menu item navigates to the correct existing routes: /, /documents, /upload, /settings.",
        "The menu can be dismissed (e.g., by selecting an item, clicking outside, or pressing Escape)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Keep role-based behavior consistent with the existing desktop header and route guards: only render the Settings navigation item when the current caller is an admin user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "yes dashboard,documents,upload,setting."
        ]
      },
      "acceptanceCriteria": [
        "When isAdmin is false, the Settings item is not visible in the mobile hamburger menu.",
        "When isAdmin is true, the Settings item is visible in the mobile hamburger menu and navigates to /settings.",
        "No change to the existing /settings route guard behavior (still admin-only)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the mobile header layout remains usable on small screens: the logo/title block, hamburger control, theme toggle, and account menu must not overlap or overflow horizontally; spacing should adapt for narrow widths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "just adapt for small screens."
        ]
      },
      "acceptanceCriteria": [
        "On common mobile widths (e.g., 320px–430px), header controls remain visible and tappable without overlapping.",
        "Header content does not cause horizontal scrolling on small screens.",
        "Keyboard navigation works for the hamburger trigger and menu items (focusable, Enter/Space activates items)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI sources are read-only and must be composed, not edited).",
    "Do not modify files listed in frontend.immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep all navigation paths and labels in English."
  ],
  "nonGoals": [
    "Implementing custom domain connection (DNS/ic-domains) changes.",
    "Adding new routes or changing existing route authorization rules beyond mirroring current admin-only Settings visibility."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}