{
  "kind": "build_request",
  "title": "Dashboard button sizing + metrics fix + consistent button colors + solid Settings dialogs",
  "projectName": "Document Archive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Dashboard page, reduce the visual size of the “Browse by Category” category cards/buttons by ~50% (padding, icon size, and typography) while keeping the same number of categories and the same click/navigation behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Dashboard - browse by category - reduce buttons by 50%",
          "reduce their size"
        ]
      },
      "acceptanceCriteria": [
        "In the Dashboard “Browse by Category” section, each category card occupies noticeably less space (approximately half the current visual footprint).",
        "Clicking a category card still navigates to /documents with the correct categoryId search param.",
        "Clicking the “View Documents” button inside a card still works and does not trigger double navigation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Dashboard page, update the category action button styling so the category buttons use a light blue color as the primary visual accent (consistent across light/dark modes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add light blue colour to the buttons."
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard “View Documents” button in each category card uses a light-blue appearance (not the default ghost style).",
        "Text remains readable with sufficient contrast in both light and dark mode."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix “Documents by Direction” counts on the Dashboard so Inward/Outward/Important reflect the actual number of stored documents by reading the direction field from the backend documents data (not returning 0 when documents exist).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "dashboard - Documents by direction count not responding it shows count 0 .",
          "from backed field of documents."
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo getDashboardMetrics returns exact counts for inwardDocuments/outwardDocuments/importantDocuments by iterating all stored documents and counting by document.direction.",
        "With at least 1 stored document of each direction, the Dashboard shows non-zero counts matching the backend data.",
        "No changes are required to the frontend query hook (useDashboardMetrics continues calling actor.getDashboardMetrics())."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the Upload page primary action button styling so the upload button uses color #0052cc (including hover/active states) and remains readable in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "upload - upload download button use color #0052cc."
        ]
      },
      "acceptanceCriteria": [
        "On UploadDocumentPage, the “Upload Document” submit button background is #0052cc.",
        "Hover/focus states remain visually clear and accessible.",
        "Disabled state remains visually distinct."
      ]
    },
    {
      "id": "REQ-5",
      "text": "In Settings, style the “Add Category” button so it appears inside a visually distinct box using color #0052cc, and ensure the Add Category / Add Office forms have a solid (non-transparent) background when opened (solid white in light mode).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "settings - add category button should be in a box colored #0052cc .",
          "form open when we click on button i want background of that form solid"
        ]
      },
      "acceptanceCriteria": [
        "On SettingsPage, the “Add Category” button is visually presented with a #0052cc box/background treatment (not default styling).",
        "When the Add Category dialog opens, the dialog content has a solid white background in light mode (no transparency).",
        "When the Add Office dialog opens, the dialog content has a solid white background in light mode (no transparency)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional canisters/services.",
    "Do not edit frontend files under frontend/src/components/ui (Shadcn UI sources); only override styling via composition/className in app components.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing the number of categories shown on the Dashboard (only reduce size, not quantity).",
    "Adding new metrics beyond Total Documents/Users and the existing direction counts.",
    "Implementing new authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}