{
  "kind": "build_request",
  "title": "Replace login screen image with uploaded photo (as-is) and bust cache",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the user-uploaded image file \"WhatsApp-Image-2020-10-24-at-11.11.10-PM-4.jpeg\" to the frontend static assets under frontend/public/assets/generated using a new versioned filename, and update the login screen to use this new asset instead of the currently referenced \"/assets/generated/login-logo-v2.dim_512x512.jpeg\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still login image is same can you share with me all images used in app so i could tell which ones to change",
          "yes",
          "yes include all",
          "yes",
          "as it is"
        ]
      },
      "acceptanceCriteria": [
        "A new static image file exists in frontend/public/assets/generated with a new, versioned filename (different from login-logo-v2.dim_512x512.jpeg) and contains the pixels from WhatsApp-Image-2020-10-24-at-11.11.10-PM-4.jpeg.",
        "frontend/src/components/auth/AuthGate.tsx uses the new versioned asset path in the <img src=...> for the unauthenticated login screen.",
        "After a hard refresh in the browser, the login screen displays the newly uploaded image (not the previously cached one)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Honor the user's request to use the uploaded image exactly as-is (no crop). Update the login image rendering on the AuthGate sign-in screen so the image is not cropped by CSS (i.e., it must not use object-cover cropping).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "as it is"
        ]
      },
      "acceptanceCriteria": [
        "The AuthGate login image is displayed without cropping any part of the image (e.g., uses object-contain or equivalent styling rather than object-cover).",
        "The image remains visually contained within the existing 128x128 (h-32 w-32) area on the login card, without overflowing the layout."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components).",
    "Do not edit the immutable hook entry points listed in SYSTEM_CONTEXT (compose around them if needed)."
  ],
  "nonGoals": [
    "Do not change authentication behavior or Internet Identity flow.",
    "Do not modify backend canister logic or data schema.",
    "Do not redesign the rest of the app UI beyond what is necessary to display the new login image without cropping."
  ],
  "imageRequirements": {
    "required": [
      "Portrait photo of a person in a striped shirt against a light background (login-logo-v3.dim_400x600.jpeg)"
    ],
    "edits": [
      "Replace the login logo asset (login-logo-v2.dim_512x512.jpeg > login-logo-v3.dim_400x600.jpeg)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}