{
  "kind": "build_request",
  "title": "Add backend user roles (admin/supervisor) with enforced access + shrink Documents-by-Direction boxes + solid popover backgrounds",
  "projectName": "Doc Archive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce the size of the three \"Documents by Direction\" count boxes on the Dashboard page (Inward/Outward/Important) by approximately 30% while keeping their current content and structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "reduce their size by 30%"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard page, the three Cards under \"Documents by Direction\" are visibly ~30% smaller (reduced padding and/or icon and font sizing), without removing any fields (label + count).",
        "No other dashboard sections (e.g., top metrics cards, category cards) change size as part of this requirement."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend-stored user accounts that include username, hashed password, and role (admin or supervisor), and provide admin-only APIs to create, update (role/password), list, and delete users.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "store users and passwords in backend.",
          "username + hashed password + role (admin/supervisor)? 1 yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists a user record containing: username, password hash (not plaintext), and role (admin|supervisor).",
        "Only admins can create/update/delete/list users; non-admin callers receive an authorization error.",
        "There is a backend API to retrieve the current caller’s role (for frontend gating)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enforce role-based access control so that admin/supervisor roles actually control access to the Settings page and the Dashboard.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "actually control access to settings and dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Frontend: attempting to navigate to /settings as a non-admin shows an English “Unauthorized” message and/or redirects to an allowed page (e.g., Dashboard).",
        "Frontend: the Settings navigation entry is hidden or disabled for non-admin users.",
        "Backend: Settings-related mutations already require admin permission; additionally, any new user-management endpoints are admin-only.",
        "Dashboard remains accessible only to authenticated users who have a recognized role (admin or supervisor); unauthorized identities are blocked with an English message."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure all popups, dialogs, and dropdown menus use a solid (non-transparent) white background in light mode, and a solid non-transparent background in dark mode, across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "error pop up is transparent use solid white  background for all pop up and dropdowns",
          "Use solid white backgrounds for all popups and dropdowns"
        ]
      },
      "acceptanceCriteria": [
        "Dropdown menus (e.g., the user menu in the header) render with an opaque background (no transparency artifacts).",
        "Dialogs and alert dialogs (e.g., Settings add/edit/delete dialogs) render with opaque backgrounds.",
        "No popover/dropdown surfaces appear translucent against page content in either light or dark theme."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration logic in backend/migration.mo if state schema changes require it per the project migration policy.",
    "Do not edit frontend paths marked immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose/wrap instead."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time features (WebSockets, push notifications, chat).",
    "Reintroducing the canceled dashboard color changes request (no new color theming changes beyond fixing popup backgrounds)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}