{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update sign-in screen logo to uploaded JPEG",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the uploaded JPEG as the only login/sign-in logo static asset under generated assets (square, not distorted).",
      "acceptanceCriteria": [
        "A new static asset exists under frontend/public/assets/generated derived from WhatsApp-Image-2020-10-24-at-11.11.10-PM-2.jpeg and is suitable for use as a logo (square/contained, not distorted).",
        "No UI on the login/sign-in screen references the old login image asset anymore (e.g., /assets/generated/auth-image.dim_512x512.jpeg is no longer used on that screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/login-logo.dim_512x512.jpeg",
          "operation": "create",
          "description": "Create a square-cropped (512x512) logo image derived from the uploaded WhatsApp-Image-2020-10-24-at-11.11.10-PM-2.jpeg, ensuring it is not stretched or distorted and is suitable for the sign-in card logo."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update AuthGate unauthenticated UI to use the uploaded logo image and a generic English alt text.",
      "acceptanceCriteria": [
        "When logged out (no identity), the logo shown above the title in the sign-in card is the uploaded image.",
        "The <img> alt text is in English and is generic (e.g., \"Login logo\"), and does not contain a real person’s name.",
        "The sign-in page renders without broken image links in both local and deployed builds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Replace the current unauthenticated logo <img> source with /assets/generated/login-logo.dim_512x512.jpeg and update the alt text to a generic English description (e.g., \"Login logo\"); ensure the previous /assets/generated/auth-image.dim_512x512.jpeg is no longer referenced in this login/sign-in UI."
        }
      ]
    }
  ]
}