{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add mobile hamburger menu to AppShell header navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a small-screen hamburger menu in the AppShell header that replaces the desktop nav buttons and navigates to existing routes (Dashboard, Documents, Upload, Settings).",
      "acceptanceCriteria": [
        "On viewport widths below the md breakpoint, the current desktop header nav buttons are not shown and a hamburger button is shown instead.",
        "Tapping/clicking the hamburger button opens a menu listing: Dashboard, Documents, Upload, and Settings.",
        "Selecting a menu item navigates to the correct existing routes: /, /documents, /upload, /settings.",
        "The menu can be dismissed (e.g., by selecting an item, clicking outside, or pressing Escape)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/MobileNavMenu.tsx",
          "operation": "create",
          "description": "Create a mobile-only header navigation control using existing shadcn-ui composed primitives (e.g., DropdownMenu + Button) to provide a hamburger trigger and menu items for Dashboard (/), Documents (/documents), Upload (/upload), and Settings (/settings). Ensure the menu closes on selection and supports Escape/outside click dismissal via the component behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the new MobileNavMenu into the header so it is visible below the md breakpoint (e.g., md:hidden), while keeping the existing desktop nav hidden on small screens (already uses md:flex). Ensure menu item navigation uses the existing TanStack Router navigation and labels remain in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Mirror existing role-based nav behavior in the mobile menu by showing Settings only for admin callers, without changing route guards.",
      "acceptanceCriteria": [
        "When isAdmin is false, the Settings item is not visible in the mobile hamburger menu.",
        "When isAdmin is true, the Settings item is visible in the mobile hamburger menu and navigates to /settings.",
        "No change to the existing /settings route guard behavior (still admin-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/MobileNavMenu.tsx",
          "operation": "modify",
          "description": "Use the existing authorization/role state already used by the desktop header (useCallerRole -> isAdmin) to conditionally render the Settings menu item only when isAdmin is true; keep other items always visible. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Pass through any required role state (or allow MobileNavMenu to read it directly) so mobile menu Settings visibility matches the current desktop header behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the header responsive and accessible on small screens so controls don’t overlap/overflow and the hamburger menu is keyboard-navigable.",
      "acceptanceCriteria": [
        "On common mobile widths (e.g., 320px–430px), header controls remain visible and tappable without overlapping.",
        "Header content does not cause horizontal scrolling on small screens.",
        "Keyboard navigation works for the hamburger trigger and menu items (focusable, Enter/Space activates items)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust header layout classes for narrow widths (e.g., reduce gaps on mobile, ensure logo/title block can shrink and truncate, prevent overflow with min-w-0 where needed, and keep right-side controls aligned). Ensure hamburger trigger, theme toggle, and account menu remain tappable without overlap and do not cause horizontal scrolling."
        },
        {
          "path": "frontend/src/components/layout/MobileNavMenu.tsx",
          "operation": "modify",
          "description": "Ensure the hamburger trigger is a focusable control and menu items are keyboard operable (Enter/Space) via the composed shadcn-ui menu primitives; confirm the menu supports focus management and dismissal behaviors. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}