{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Document Archive: Dashboard sizing + button color consistency + solid Settings dialogs",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reduce Dashboard “Browse by Category” category card/button visual footprint ~50% while preserving navigation behavior.",
      "acceptanceCriteria": [
        "In the Dashboard “Browse by Category” section, each category card occupies noticeably less space (approximately half the current visual footprint).",
        "Clicking a category card still navigates to /documents with the correct categoryId search param.",
        "Clicking the “View Documents” button inside a card still works and does not trigger double navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Update the “Browse by Category” Card/CardContent sizing (reduce padding, icon container size, icon size, and typography) while keeping the same map over categories and existing navigate + stopPropagation behavior. Use shadcn-ui Card/Button via className overrides only; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make Dashboard category action buttons use a light-blue primary accent with readable contrast in light/dark modes.",
      "acceptanceCriteria": [
        "The Dashboard “View Documents” button in each category card uses a light-blue appearance (not the default ghost style).",
        "Text remains readable with sufficient contrast in both light and dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Change the “View Documents” Button styling from ghost to a light-blue accented look using Tailwind className overrides (including hover/focus states) with explicit dark-mode classes to ensure consistent accent and contrast. Use shadcn-ui Button via composition/className (do not edit ui sources); Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Style the Upload page primary submit button to use #0052cc with accessible hover/active/disabled states across themes.",
      "acceptanceCriteria": [
        "On UploadDocumentPage, the “Upload Document” submit button background is #0052cc.",
        "Hover/focus states remain visually clear and accessible.",
        "Disabled state remains visually distinct."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadDocumentPage.tsx",
          "operation": "modify",
          "description": "Override the submit Button (type=\"submit\") styling to use background #0052cc with explicit hover/active/focus-visible and disabled Tailwind classes, ensuring readable text in both light/dark modes. Use shadcn-ui Button via className overrides only; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Improve Settings Add Category button presentation with #0052cc box treatment and ensure Add Category/Add Office dialogs have solid white backgrounds in light mode.",
      "acceptanceCriteria": [
        "On SettingsPage, the “Add Category” button is visually presented with a #0052cc box/background treatment (not default styling).",
        "When the Add Category dialog opens, the dialog content has a solid white background in light mode (no transparency).",
        "When the Add Office dialog opens, the dialog content has a solid white background in light mode (no transparency)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Restyle the “Add Category” trigger to present it in a visually distinct #0052cc box/background treatment using wrapper + Button className overrides. Update the Add Category and Add Office DialogContent className to use solid white background in light mode (e.g., bg-white) while preserving appropriate dark mode styling. Use shadcn-ui Dialog/Button via composition/className (do not edit ui sources); Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}