{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix post-login permissions gate hang and add reliable role-check completion",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent the authenticated role gate from staying indefinitely on \"Checking permissions...\" after Internet Identity login and ensure it either renders the requested page (default \"/\" dashboard) or reaches a terminal error UI with actions.",
      "acceptanceCriteria": [
        "After completing an Internet Identity login redirect, the app does not remain on the \"Checking permissions...\" screen indefinitely.",
        "When role resolution completes successfully, the dashboard at path \"/\" renders normally for authorized users.",
        "If role resolution fails (e.g., backend call error), the UI shows a clear error state with an actionable way to retry and/or navigate to the dashboard, rather than showing an infinite spinner."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Add a bounded permissions-check lifecycle: introduce a timeout-based terminal state for prolonged loading, render a dedicated error UI on role-fetch errors or prolonged actor initialization, and provide actions to retry the permission check and navigate to \"/\". Use shadcn-ui Button/Card primitives for consistent UI (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/PermissionsErrorScreen.tsx",
          "operation": "create",
          "description": "Create a focused permissions error screen component that explains the permissions check failure/stall and offers primary actions: retry the permissions check and go to the dashboard route \"/\". Use shadcn-ui components (e.g., Card, Button) for layout and actions (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the caller-role fetch used by the permissions gate resilient to actor initialization edge cases and provide a UI-driven retry without page refresh.",
      "acceptanceCriteria": [
        "Role fetching transitions out of the loading state reliably after login (either to success or a visible error state).",
        "A user can trigger a retry of the role check from the UI without a full page refresh (if the first attempt fails)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/auth/useCallerRole.ts",
          "operation": "modify",
          "description": "Harden the role-fetch hook so it reliably reaches success or error: surface explicit state for actor-not-ready vs role-fetch-error, expose a dedicated retry helper (e.g., invalidate/refetch role query) that RequireRole can call, and ensure loading flags cannot mask an error indefinitely. Keep useActor/useInternetIdentity untouched per constraints."
        },
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Wire UI retry to the role-fetch retry helper and (when appropriate) trigger a re-check when identity becomes available after login redirect. Ensure the component transitions from loading to either authorized render or a visible error state with retry, without requiring a full page refresh. Use shadcn-ui Button for retry action (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}