{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard categories from backend + filtered multi-select Excel export",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a Dashboard page that fetches categories at runtime from the backend and renders them as large, clickable buttons (English UI).",
      "acceptanceCriteria": [
        "A new route/page exists for a dashboard that lists all available categories as large clickable buttons.",
        "The list of categories is fetched from the backend at runtime (no hardcoded category options list used for the dashboard).",
        "User-facing text on the dashboard is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "create",
          "description": "Implement the Dashboard page UI that loads categories via the existing backend actor capability (getCategories) at runtime and displays them as large buttons/cards; use shadcn-ui components for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/categories/useCategories.ts",
          "operation": "create",
          "description": "Add a React Query hook that calls the backend actor to fetch the authoritative categories list for the dashboard and other category-driven UIs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enable category-button navigation from Dashboard to Documents list with the category filter pre-applied and compatible with office filter auto-clearing behavior.",
      "acceptanceCriteria": [
        "Clicking a category on the dashboard opens the documents list view with that category already selected.",
        "The documents table shows only documents that belong to the selected category until the user changes/clears filters.",
        "Existing office filtering behavior remains compatible with the selected category (invalid office selections are cleared as today)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update routing to support passing an optional category selection into the Documents list via route search params/state, and add a dashboard route so navigation can target it."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Wire category button clicks to navigate to the Documents list route with the selected category pre-applied (e.g., via router search params). Use shadcn-ui Button styling for large clickable category actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DocumentListPage.tsx",
          "operation": "modify",
          "description": "Initialize and keep the category filter in sync with the router-provided preselected category when arriving from the Dashboard, without breaking existing filter interactions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add multi-select to the filtered Documents table and export only the user-selected items from the currently filtered results as an Excel-compatible download.",
      "acceptanceCriteria": [
        "The documents table supports multi-select of documents currently shown under the active filters (including category).",
        "An Export control is available on the documents list page.",
        "Export generates an Excel-compatible file for download containing only the selected documents from the filtered results (not all documents).",
        "If no documents are selected, the UI clearly indicates that selection is required before export (English message)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/documents/DocumentList.tsx",
          "operation": "modify",
          "description": "Add row checkboxes (and an optional select-all for currently displayed rows) to support multi-select of documents shown in the current filtered view; ensure row click-to-navigate remains usable (e.g., checkbox click does not navigate). Use shadcn-ui checkbox/table patterns where applicable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DocumentListPage.tsx",
          "operation": "modify",
          "description": "Add selection state management, an Export action control, and an English validation message when exporting with zero selected items; ensure selection is cleared/reset appropriately when filters change so export cannot include items outside the current filtered results."
        },
        {
          "path": "frontend/src/lib/exportDocuments.ts",
          "operation": "create",
          "description": "Implement a small client-side export utility that generates an Excel-compatible file (e.g., CSV with appropriate headers) from selected Document rows and triggers browser download, using only the selected subset passed in."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Expose the Dashboard from main navigation while preserving existing access to Documents list, document detail, and Upload routes.",
      "acceptanceCriteria": [
        "The app has a dedicated route for the Dashboard page.",
        "The header navigation includes a way to reach the Dashboard and the Documents list (labels in English).",
        "Existing routes for document detail and upload continue to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new Dashboard route in the router while keeping existing routes for documents list, upload, and document detail working as-is."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add a Dashboard navigation item in the header (English label), alongside existing Documents and Upload navigation, using existing shadcn-ui Button styling. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}