{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a document app with a dashboard showing category buttons (loaded from the database) that filter documents by category; documents belong to a single category and office; allow exporting a multi-selected, filtered document list to Excel.",
  "architectural_notes": [
    "Dashboard categories should be loaded dynamically from the database (no hardcoded category list).",
    "Each document is associated with exactly one category and one office.",
    "Excel export should operate on the currently filtered document list and support exporting only user-selected documents."
  ],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-add-a-new-dashboard-page-that-shows-large-category-buttons-loaded-dynamically-from-the-backend-not-hardcoded-in-the-frontend",
      "title": "Add a new Dashboard page that shows large category buttons loaded dynamically from the backend (not hardcoded in the frontend).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-when-a-user-clicks-a-category-button-on-the-dashboard-navigate-to-the-documents-list-and-show-only-documents-for-that-category-category-filter-pre-applied",
      "title": "When a user clicks a category button on the Dashboard, navigate to the Documents list and show only documents for that category (category filter pre-applied).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-documents-list-ui-to-support-selecting-multiple-documents-from-the-currently-filtered-list-e-g-via-row-checkboxes-and-provide-an-export-action-that-exports-only-the-filtered-list-items-the-user-selected",
      "title": "Update the Documents list UI to support selecting multiple documents from the currently filtered list (e.g., via row checkboxes) and provide an export action that exports only the filtered list items the user selected.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-adjust-the-application-routing-navigation-so-the-dashboard-is-accessible-from-the-main-navigation-while-preserving-access-to-the-documents-list-and-upload-page",
      "title": "Adjust the application routing/navigation so the Dashboard is accessible from the main navigation, while preserving access to the Documents list and Upload page.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add dashboard page with large category buttons loaded dynamically from database; clicking a category shows only documents for that category.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Documents data model: each document belongs to exactly one category and one office; support filtering document list by selected category.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add Excel export on documents page for the currently filtered list, with multi-select option to export selected documents.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Add backend APIs needed to support dynamic category listing for the Dashboard (and any other UI that needs a category list) using the backend’s authoritative category set.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Document Archive",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}